import React, { useState, useEffect } from 'react';
import './App.css';
import GifComponent from './GifComponent';
import final1 from './assets/final.gif';
import final2 from './assets/final2.gif';
import final3 from './assets/fianl3.gif';

const gifs = [final1, final2, final3];


const desktopPositions = [
  { left: '10%', top: '10%' },
  { left: '20%', top: '30%' },
  { left: '30%', top: '50%' },
  { left: '40%', top: '70%' },
  { left: '50%', top: '20%' },
  { left: '60%', top: '40%' },
  { left: '70%', top: '60%' },
  { left: '80%', top: '30%' },
  { left: '90%', top: '50%' },
  { left: '15%', top: '70%' },
  { left: '25%', top: '10%' },
  { left: '35%', top: '30%' },
  { left: '50%', top: '60%' },
  { left: '55%', top: '80%' },
  { left: '65%', top: '10%' },
  { left: '75%', top: '40%' },
  { left: '85%', top: '60%' },
  { left: '95%', top: '30%' },
  { left: '5%', top: '50%' },
  { left: '30%', top: '70%' },
];

const mobilePositions = [
  { left: '5%', top: '5%' },
  { left: '10%', top: '20%' },
  { left: '15%', top: '35%' },
  { left: '18%', top: '47%' },
  { left: '17%', top: '65%' },
  { left: '30%', top: '85%' },
  { left: '35%', top: '10%' },
  { left: '40%', top: '25%' },
  { left: '45%', top: '35%' },
  { left: '50%', top: '55%' },
  { left: '55%', top: '70%' },
  { left: '60%', top: '95%' },
  { left: '65%', top: '0%' },
  { left: '70%', top: '30%' },
  { left: '75%', top: '45%' },
  { left: '80%', top: '60%' },
  { left: '85%', top: '75%' },
  { left: '90%', top: '17%' },
  { left: '95%', top: '35%' },
  { left: '5%', top: '75%' },
];

const App = () => {
  const [lightsOff, setLightsOff] = useState(false);
  const [showNewContent, setShowNewContent] = useState(false);
  const [isMobile, setIsMobile] = useState(window.innerWidth <= 600);
  const [phraseIndex, setPhraseIndex] = useState(0);

  const phrases = [
  "I Love You",        // English
  "Je t'aime",         // French
  "Te amo",            // Spanish
  "Ich liebe dich",    // German
  "Ti amo",            // Italian
  "Eu te amo",         // Portuguese
  "愛してる",            // Japanese
  "사랑해",             // Korean
  "Я люблю тебя",      // Russian
  "אני אוהב אותך",
  "我爱你",             // Chinese (Simplified)
  "أنا أحبك",         // Arabic
  "Ik hou van jou",    // Dutch
  "Kocham cię",        // Polish
  "Σ' αγαπώ",         // Greek
  "Te iubesc",         // Romanian
  "Jeg elsker deg",    // Norwegian
  "Jag älskar dig",    // Swedish
  "Jeg elsker dig",    // Danish
  "ฉันรักคุณ",          // Thai
  "Te quiero",         // Filipino (Tagalog)
];




  useEffect(() => {
    const handleResize = () => {
      setIsMobile(window.innerWidth <= 600);
    };
    window.addEventListener('resize', handleResize);
    return () => window.removeEventListener('resize', handleResize);
  }, []);

  useEffect(() => {
    const interval = setInterval(() => {
      setPhraseIndex((prevIndex) => (prevIndex + 1) % phrases.length);
    }, 1700); // Change text every second
    return () => clearInterval(interval);
  }, [phrases.length]);

  const handleToggleLightsOff = () => {
    setLightsOff(true);
    setTimeout(() => {
      setShowNewContent(true);
    }, 750); // Match this with the CSS transition duration
  };

  const positions = isMobile ? mobilePositions : desktopPositions;
  const components = positions.map((position, index) => {
    const randomGif = gifs[Math.floor(Math.random() * gifs.length)];
    return <GifComponent key={index} src={randomGif} style={position} />;
  });

  return (
    <div className={`App ${lightsOff ? 'lights-off' : ''}`}>
      <div className="content-container">
        {!showNewContent ? (
          <>
            <h1 className="center-text" onClick={handleToggleLightsOff}>{phrases[phraseIndex]}</h1>
            {components}
            <footer className='footer' >E+M 07/03/2024-∞</footer>
          </>
        ) : (
          <div className="new-content">          
          <h1>
          </h1>
            <p>*מיכל,אני עדיין לא מאימן שאת חברה,בת זוג,אישה,כמעט אמא לידלים,שלי אני רוצה שתדעי שזה יום לא פחות חשוב לי מאשר לך *אי אפשר לשים פה סוגרים אבל מקווה שזה יום חשוב לך</p>
            <p>אני רוצה שתדעי שזה יום גם חשוב לי כי אני מציין אותו איתך לא עם איזה סתם בחרוה אלה עם פאקינג מיכל דולגין את לא מבינה עד כמה זה פלקס בישבילי לומר שאני חבר/בן זוג שלך</p>
            <p>את לא מבינה כמה שאת שווה לא רק מבחינה של מראה גם כאישיות את אחת כזו ואין ולא יהיה אחת אחרת</p>
            <p>אני יודע שכבר חפרתי עם הפסקאות והנה אני מפיל עלייך פסקה בגודל אקסטרה לארג אבל אני רוצה שאת תדעי שאת שווה כל מילה ומילה שרשומה פה ,כל שניה ושניה שאני חושב מה לרשום פה,כל רעיון כל דבר את פאקניג שווה כל דבר</p>
            <p>מרוב שאני חפרתי עם הפסקאות אין לי כבר רעיונות מה לרשום אבל משום מה אני תמיד מוצא מה לרשום למה? כי זה פסקאות לא לאיזה בחרוה אלה פאקינג בישבילך בישביל מיכל דולגין</p>
            <p>אני רושם את זה כשאני עוד בבולגריה ואת יודעת עד כמה שחרא לי פה אבל כשאני פשוט ישבתי לעבוד על זה זה פשוט העלה לי את המצב רוח ופשוט גרם לי לשכוח מכל החרא שיש זה כמעט כמעט אותה הרגשה כשאני איתך</p>
            <p>את גם יודעת שאני פחות בקטע של תכנות בצד לקוח אבל אגלה לך סוד כל השיט שבזכותו יש את מה שיש זה 95 אחוז צד לקוח וכל השאר זה לגרור חרא א לחרא ב למרות שאני לא סובל צד לקוח אני עשיתי אותו בשבילך</p>
            <p>זה יחזיר קצת לימים אפלים הכמה שורות הבאות אז סורי , בשיחה הלא כפית הראשונה את אמרת שאת לא רוצה שאני אשתנה/לשנות אותי אבל מה שאת לא הבנת וגם כנראה עכשיו לא מבינה זה שאת שווה את השינוי</p>
            <p>את שווה לצאת מאיזור הנוחות ולנסות דברים חדשים שלא חשבתי שאני אנסה אי פעם את שווה לקום בבוקר ופשוט לרצות להיות יותר טוב</p>
            <p>אני לא רציתי לספר לך דרך הטלפון ולא חושב שבכללי רציתי לספר לך למה חרא לי בבולגריה ולמה לא ישנתי באותו לילה אבל כשעכשיו אני רושם את זה אני מביו שאם אני לא אספר אז כל מה שרשמתי פה זה שקר אז זה למה רשמתי לך ״מיכל אפשר לשאול אותך משהו״</p>
            <p>כל מה שרשמתי למטה זה אחרי שאת ענית לי חשבתי שאת לא רושמת לי כי אני לא רושם ראשון אבל הבנתי שאת לא רושמת לי כי את פאקינג כיבדת את זה שאני מעדיף להיות לבד</p>
            <p>כשהרגשתי חרא בבולגריה זה שפשוט רשמת לי גרם לי לשכוח מכל החרא שהרגשתי עם הודעה אחת את גרמת לי להרגיש ? אני לא יודע איך להסביר אבל פשוט גרמת לכל הבעיות להיעלם</p>
            <p>מיכל אני רוצה שתדעי שאת הכי חשובה ולי ושאני לעולם לא רוצה לאבד אותך ושאני תמיד רוצה שיהיה לך טוב ושאני תמיד אוהב אותך ושאני לא יכול בלעדייך וחושב עלייך ורק פאקניג עלייך 24/7 זה משהו מטורף עד כמה שאני לא האמנתי שאחרי הדייט הראשון יהיה דייט שני והנה עכשיו תראי לאן הגענו</p>
            <p>עכשיו קצת רקע כדי שתרגישי פחות חרא עם זה שלא האמנת שנחזיק, אז קיצר אני די בטוח שכבר סיפרתי לך את זה אבל אני אספר שוב אז ככה עוד שבוע לפני הדייט הראשון התחלתי ככה לא לסתום את הפה שאני הולך לצאת איתך</p>
            <p>ומשם עלו כזה דברים לא כיפים עלייך וואלה אני כבר רציתי לבטל את הדייט ואז את כבר ביטלת ואז לא רציתי לרשום שוב אם את יכולה ואז משהו בי גרם לי לרשום</p>
            <p>כן כי אני יודע שלא לשפוט אנשים לפני שאשכרה פאקינג יוצא לך להכיר אותם לפחות איכשהו אבל כן אניוויז כשהגענו לדייט וזה עד השניה האחרונה לא האמנתי שזה יעבוד היו סיבות כאלה ואחרונות לא קיריטי אבל כן</p>
            <p>ועכשיו פאקינג תראי לאין הגענו הזוג הכי שנוא בבית ספר מרוב שהוא הזוג הכי גואט שהיה אי פעם</p>
            <p>ובזכות מי? בזכותך!!! שאת משום מה בחרת להמשיך איתי ולא פשוט להגיד ״לעע אני לא חושבת שזה יעבוד יאללה באבאי״</p>
            <p>בזכותך שאת כן משתפת איתי כשמשהו לא בסדר איתך למרות שזה קשה לך ולמרות שאת לא אוהבת ולא רוצה וכל זה כי משום מה את רוצה להיות עם האקוסטי שאני ואני עוד פאקינג מבקש ריאשונרס כיאלו שכל שזה שאת נתת לי אז אור ירוק זה לא מספיק *פליז תני לי תמיד ריאשורנס אני מפחד לאבד אותך* פליז</p>
            <p>אני רוצה גם להוסיף שאם משום מה את חושבת שלארחים יש את הפאקינג יכולת להוריד לך בצורה כלשהי לא משנה איך לקלל אותך להפיץ שמועות לא יודע אני לא מכיר בעניינים של בנות אז שתדעי לך שאני מוכן לקבור כל בן זונה שקם עלייך ושבכלל אני רוצה שתדעי לא נראלי שאת צריכה לשים זין למה כל פעם</p>
            <p>שאנחנו בחוץ אני תמיד מסתכל על אנשים שעוברים לידניו ואז מסתכלים אלייך ואז מסתכלים עלי ומפנים מבט זה מעצבן שאני יודע שיש איזה בחור שהיה מת להיות איתך ושפשוט שניגשים לדבר איתך אבל ככה אני יודע שאת זה באמת משהו שווה ואני מזליזת כי כולם רוצים אותך בגלל המראה שלך ואני מכיר גם את האישיות שלך ומבין עוד יותר כמה זכיתי שמצאתי אותך בדור המזדיין הזה ושאם חס וחלילה לעולם לא טפוטפוטפו אני אאבד אותך זה יהיה בלטי אפשרי להחיף אותך</p>
            <p>בקיצור אני אחושרמוטה גאה בך ושמח שאת שממחה ושמח שאת איתי וגאה לומר שאת מיכל דולגין חברה שלי</p>
            <p>אני אוהב אותך מיכל ומקווה ורוצה שנחזיק לנצח</p>
            
            <h2 className="new-text">E+M 07/03/2024-∞</h2>
          </div>
        )}
      </div>
    </div>
  );
};

export default App;
