import React, { useState } from 'react';
import './App.css';
import GifComponent from './GifComponent';
import final1 from './assets/final.gif';
import final2 from './assets/final2.gif';
import final3 from './assets/fianl3.gif';

const gifs = [final1, final2, final3];

// Define specific positions for the GIFs
const positions = [
  { left: '10%', top: '10%' },
  { left: '20%', top: '30%' },
  { left: '30%', top: '50%' },
  { left: '40%', top: '70%' },
  { left: '50%', top: '20%' },
  { left: '60%', top: '40%' },
  { left: '70%', top: '60%' },
  { left: '80%', top: '30%' },
  { left: '90%', top: '50%' },
  { left: '15%', top: '70%' },
  { left: '25%', top: '10%' },
  { left: '35%', top: '30%' },
  { left: '50%', top: '60%' },
  { left: '55%', top: '80%' },
  { left: '65%', top: '10%' },
  { left: '75%', top: '40%' },
  { left: '85%', top: '60%' },
  { left: '95%', top: '30%' },
  { left: '5%', top: '50%' },
  { left: '30%', top: '70%' },
];

const App = () => {
  const [lightsOff, setLightsOff] = useState(false);
  const [showNewContent, setShowNewContent] = useState(false);

  const handleToggleLightsOff = () => {
    setLightsOff(true);
    setTimeout(() => {
      setShowNewContent(true);
    }, 1000); // Match this with the CSS transition duration
  };

  const components = positions.map((position, index) => {
    const randomGif = gifs[Math.floor(Math.random() * gifs.length)];
    return <GifComponent key={index} src={randomGif} style={position} />;
  });

  return (
    <div className={`App ${lightsOff ? 'lights-off' : ''}`}>
      {!showNewContent ? (
        <>
          <h1 className="center-text" onClick={handleToggleLightsOff}>I Love You</h1>
          {components}
          <footer className='footer'>E+M 07/03/2024-∞</footer>
        </>
      ) : (
        <div className="new-content">
          <text className="new-text">
              *מיכל,אני עדיין לא מאימן שאת חברה,בת זוג,אישה,כמעט אמא לידלים,שלי אני רוצה שתדעי שזה יום לא פחות חשוב לי מאשר לך *אי אפשר לשים פה סוגרים אבל ממקווה שזה יום חשוב לך
          </text>
          <text>
            אני רוצה שתדעי שזה יום גם חשוב לי כי אני מציין אותו איתך לא עם איזה סתם בחרוה אלה עם פאקינג מיכל דולגין את לא מבינה עד כמה זה פלקס בישבילי לומר שאני חבר/בן זוג שלך 
          </text>
          <text>
            את לא מבינה כמה שאת שווה לא רק מבחינה של מראה גם כאישיות את אחת כזו ואין ולא יהיה אחת אחררת 
          </text>
          <text>
            אני יודע שכבר חפרתי עם הפסקאות והנה אני מפיל עלייך פסקה בגודל אקסטרה לארג אבל אני רוצה שאת שווה כל מילה ומילה שרשומה פה ,כל שניה ושניה שאני חושב מה לרשום פה,כל רעיון כל דבר את פאקניג שווה כל דבר
          </text>
          <text>
            מרוב שאני חפרתי עם הפסקאות אין לי כבר ראיונות מה לרשום אבל משום מה אני תמיד מוצא מה לרשום למה? כי זה פסקאות לא לאיזה בחרוה אלה פאקינג בישבילך בישביל מיכל דולגין
          </text>
          <text>
            אני רושם את זה כשאני עוד בבולגריה ואת יודעת עד כמה שחרא לי פה אבל כשאני פשוט ישבתי לעבוד על זה זה פשוט העלה לי את המצב רוח ופשוט גרם לי לשכוח מכל החרא שיש זה כמעט כמעט אותה הרגשה כשאני איתך
          </text>
          <text>
            את גם יודעת שאני פחות בקטע של תכנות בצד לקוח אבל אגלה לך סוד כל השיט שבזכותו יש את מה שיש זה 95 אחוז צד לקוח וכל השאר זה לגרור חרא א לחרא ב למרות שאני לא סובל צד לקוח אני עשיתי אותו בשבילך
          </text>
          <text>
            זה יחזיר קצת ליממים אפלים הכמה שורות הבאות אז סורי , בשיחה הלא כפית הראשונה את אמרת שאת לא רוצה שאני אשתנה/לשנות אותי אבל מה שאת לא הבנת וגם כנראה עשכיט לא מבינה זה שאת שווה את השינוי
          </text>
          <tetx>את שווה לצאת מאיזור הנוחות ולנסות דברים חדשים שלא חשבתי שאני אנסה אי פעם את שווה לקום בבוקר ופשוט לרצות להיות יותר טוב</tetx>
          <tetx>
            אני לא רציתי לספר לך דרך הטלפון ולא חושב שבכללי רציתי לספר לך למה חרא לי בבולגריה ולמה לא ישנתי באותו לילה אבל כשעכשיו אני רושם את זה אני מביו שאם אני לא אספר אז כל מה שרשמתי פה זה שקר אז זה למה רשמתי לך ״מיכל אפשר לשאול אותך משהו״
          </tetx>
          <tetx>כל מה שרשמתי למטה זה אחרי שאת ענית לי חשבתי שאת לא רושמת לי כי אני לא רושם ראשון אבל הבנתי שאת לא רושמת לי כי  את פאקינג כיבדת את זה שאני מעדיף להיות לבד </tetx>
          <tetx>כשהרגשתי חרא בבולגריה זה שפשוט רשמת לי גרם לי לשכוח מכל החרא שהרגשתי עם הודעה אחת את גרמת לי להרגיש ? אני לא יודע איך להסביר אבל פשוט גרמת לכל הבעיות להיעלם </tetx>
          <tetx>
            מיכל אני רוצה שתדעי שאת הכי חשובה ולי ושאני לעולם לא רוצה לאבד אותך ושאני תמיד רוצה שיהיה לך טוב ושאני תמיד אוהב אותך ושאני לא יכול בלעדייך וחושב עלייך ורק פאקניג עלייך 24/7 זה משהו מטורף עד כמה שאני לא האמנתי שאחרי הדייט הראשון יהיה דייט שני והנה עכשיו תרי לאן הגענו
          </tetx>
          <text>עכשיו קצת רקע כדי שתרגישי פחות חרא עם זה שלא האמנת שנחזיק, אז קיצר אני די בטוח שכבר סיפרתי לך את זה אבל אני אספר שוב אז ככה עוד שבוע לפני הדייט הראשון התחלתי ככה לא לסתום את הפה שאני הולך לצאת איתך </text>
          <text>ומשם עלו כזה דברים לא כיפים עלייך וואלה אני כבר רציתי לבטל את הדייט ואז את כבר ביטלת ואז לא רציתי לרשום שוב אם את יכולה ואז משהו בי גרם לי לרשום </text>
          <text>כן כי אני יודע שלא לשפוט אנשים לפני שאשכרה פאקינג יוצא לך להכיר אותם לפחות איכשהו אבל כן אניוויז כשהגענו לדייט וזה עד השניה האחרונה לא האמנתי שזה יעבוד היו סיבות כאלה ואחרונות לא קיריטי אבל כן</text>
          <text>ועכשיו פאקינג תראי לאין הגענו הזוג הכי שנוא בבית ספר מרוב שהוא הזוג הכי גואט שהיה אי פעם </text>
          <text>ובזכות מי? בזכותך!!! שאת משום מה בחרת להמשיך איתי ולא פשוט להגיד ״לעע אני לא חושבת שזה יעבוד יאללה באבאי״</text>
          <text>בזכותך שאת כן משפתפת איתי כשמשהו לא בסדר איתך למרות שזה קשה לך ולמרות שאת לא אוהבת ולא רוצה וכל זה כי משום מה את רוצה להיות עם האקוסטי שאני ואני עוד פאקינג מבקש ריאשונרס כיאלו שכל שזה שאת נתת לי אז אור ירוק זה לא מספיק *לא זה פלי תני לי תמיד ריאשורנס* פליז</text>
          <text>אני רוצה גם להוסיף שאם משום מה את חושבת שלארחים יש את הפאקינג יכולת להוריד לך בצורה כלשהי לא משנה איך לקלל אותך והפיץ שמועות לא יודע אני לא מכיר בעניינים של בנות אז שתדעי לך שאני מוכן לקבור כל בן זונה שקם עלייך ושבכלל לא נראלי שאת צריכה לשים זין למה כל פעם </text>
          <text>שאנחנו בחוץ אני תמיד מסתכל על אנשים שעוברים לידניו ואז מסתכלים אלייך ואז מסתכלים עלי ומפנים מבט זה מעצבן שאני יודע שיש איזה בחור שהיה מת להיות איתך ושפשוט שניגשים לדבר איתך אבל ככה אני יודע שאת זה באמת משהו שווה ואני מזליזת כיכולם רוצים אותך בגלל המראה שלך ואני מכיר גם את האישיות שלך וממבין עוד יותר כמה זכיתי שמצאתי אותך בדור המזדיין הזה ושאם חס וחלילה לעולם לא טפוטפוטפו אני אאבד אותך זה יהיה בלטי אפשרי להחיף אותך</text>
          <text>בקיצור אני אחושרמוטה גאה בך ושמח שאת שממחה ושמח שאת איתי וגאה לומר שאת מיכל דולגין חברה שלי</text>
          <text>אני אוהב אותך מיכל ומקווה ורוצה שנחזיק לנצח</text>
          <h2 className="new-text">E+M 07/03/2024-∞</h2>
        </div>
      )}
    </div>
  );
};

export default App;
